# DAN AHIMBISIBWE - da3658 - HOMEWORK 5 -WEEK 5 - SQL

## 1. https://leetcode.com/problems/actors-and-directors-who-cooperated-at-least-three-times/

In [3]:
# Write your MySQL query statement below

SELECT actor_id, director_id
FROM ActorDirector
GROUP BY actor_id, director_id
HAVING COUNT(*) >= 3;

## 2. https://leetcode.com/problems/fix-names-in-a-table/

In [ ]:
# Write your MySQL query statement below

SELECT
    Users.user_id,
    CONCAT(UPPER(SUBSTR(Users.name, 1, 1)), LOWER(SUBSTR(Users.name, 2))) AS name
FROM
    Users
ORDER BY
    Users.user_id ASC;

## 3. https://leetcode.com/problems/combine-two-tables/

In [ ]:

# Write your MySQL query statement below
SELECT P.firstName, P.lastName, A.city, A.state
FROM Person AS P
LEFT JOIN 
Address AS A
ON P.personId = A.personId

## 4. https://leetcode.com/problems/second-highest-salary/description/

In [ ]:
# Write your MySQL query statement below

SELECT (
    SELECT distinct salary 
    FROM Employee
    ORDER BY salary DESC
    LIMIT 1 OFFSET 1
) AS SecondHighestSalary;

## 5. https://leetcode.com/problems/list-the-products-ordered-in-a-period/description/

In [ ]:
# Write your MySQL query statement below
SELECT product_name,SUM(unit) AS unit
FROM Products p
JOIN Orders o
ON p.product_id =o.product_id
WHERE DATE_FORMAT(order_date,'%Y-%m') = '2020-02' 
GROUP BY o.product_id
HAVING SUM(unit) >=100

## 6. https://leetcode.com/problems/replace-employee-id-with-the-unique-identifier/description/

In [ ]:
# Write your MySQL query statement below
Select eu.unique_id, e.name
from EmployeeUNI eu
right join Employees e
on e.id = eu.id

## 7. https://leetcode.com/problems/game-play-analysis-iv/description/

In [ ]:
# Write your MySQL query statement below
SELECT

    round(
        avg(CASE WHEN a2.player_id IS NOT NULL THEN 1 ELSE 0 END)
    , 2) as fraction
FROM
    activity a1
    LEFT JOIN
    activity a2
    ON
        a1.player_id = a2.player_id
        AND
        a1.event_date = date_sub(a2.event_date, interval 1 day)
WHERE 
    (a1.player_id, a1.event_date) IN (
        SELECT 
            player_id, 
            min(event_date)
        FROM 
            activity
        GROUP BY 
            player_id
    )

## 8. https://leetcode.com/problems/project-employees-i/description/

In [ ]:
# Write your MySQL query statement below
select project_id, round(sum(experience_years)/count(project_id),2) as average_years
from Project p
left join Employee e
on p.employee_id=e.employee_id
group by project_id;

## 9. https://leetcode.com/problems/department-top-three-salaries/description/

In [ ]:
# Write your MySQL query statement below
SELECT Department, employee, salary FROM (
    SELECT d.name AS Department
        , e.name AS employee
        , e.salary
        , DENSE_RANK() OVER (PARTITION BY d.name ORDER BY e.salary DESC) AS drk
    FROM Employee e JOIN Department d ON e.DepartmentId= d.Id
) t WHERE t.drk <= 3# Write your MySQL query statement below
SELECT Department, employee, salary FROM (
    SELECT d.name AS Department
        , e.name AS employee
        , e.salary
        , DENSE_RANK() OVER (PARTITION BY d.name ORDER BY e.salary DESC) AS drk
    FROM Employee e JOIN Department d ON e.DepartmentId= d.Id
) t WHERE t.drk <= 3